Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: +-------------------------------------------------------+---------------------------------------+ | Method | Usage | +=======================================================+=======================================+ | ``getName()`` | Get provider name (label) | +-------------------------------------------------------+---------------------------------------+ | ``fetch()`` | Retrieve task from external system or | | | cache | +-------------------------------------------------------+---------------------------------------+ | ``save($uri, array $formValues, array &$formErrors)`` | Save external task to another system | +-------------------------------------------------------+---------------------------------------+ | ``getImportFormTemplate()`` | Get task import template name | +-------------------------------------------------------+---------------------------------------+ | ``getCreationFormTemplate()`` | Get creation form template | +-------------------------------------------------------+---------------------------------------+ | ``getModificationFormTemplate()`` | Get modification form template | +-------------------------------------------------------+---------------------------------------+ | ``getViewTemplate()`` | Get task view template name | +-------------------------------------------------------+---------------------------------------+ | ``buildTaskUri(array $formValues)`` | Build external task URI based on | | | import form values | +-------------------------------------------------------+---------------------------------------+
ja: +-------------------------------------------------------+---------------------------------------+ | メソッド | 使用方法 | +=======================================================+=======================================+ | ``getName()`` | プロバイダ名 (label) を取得 | +-------------------------------------------------------+---------------------------------------+ | ``fetch()`` | 外部システムorキャッシュから | | | タスクのフォームを回収 | +-------------------------------------------------------+---------------------------------------+ | ``save($uri, array $formValues, array &$formErrors)`` | 別のシステムに外部タスクを保存 | +-------------------------------------------------------+---------------------------------------+ | ``getImportFormTemplate()`` | タスクをインポートするテンプレート名を取得 | +-------------------------------------------------------+---------------------------------------+ | ``getCreationFormTemplate()`` | テンプレートのフォームを作成 | +-------------------------------------------------------+---------------------------------------+ | ``getModificationFormTemplate()`` | テンプレートのフォームを変更 | +-------------------------------------------------------+---------------------------------------+ | ``getViewTemplate()`` | タスクビューのテンプレート名を取得 | +-------------------------------------------------------+---------------------------------------+ | ``buildTaskUri(array $formValues)`` | インポートしたフォームの値を元に | | | 外部タスクのURIをビルドする | +-------------------------------------------------------+---------------------------------------+

source: - Bold text: Use 2 asterisks or 2 underscores
ja: - 太字: 2つのアスタリスク(&#42;&#42;)か、2つのアンダーバー(&#095;&#095;)を使用します

source: Server Side -----------
ja: サーバー側 -----------

source: - Install PHP by following the official documentation:
ja: - 公式ドキュメントに従って PHP をインストールする:

source: From the archive (stable version) ---------------------------------
ja: アーカイブよりインストール (安定版) ---------------------------------

source: export:transitions Task transitions CSV export
ja: export:transitions タスクの推移をCSVでエクスポート

source: - Purpose: **Update a category**
ja: - 用途: **カテゴリのアップデート**

source: Read multiple entries:
ja: 複数のエントリーを読み込む:

source: From the dashboard, click on the link **New project**:
ja: ダッシュボードから **プロジェクト作成** のリンクをクリックしてください:

source: Group Provider Interface ------------------------
ja: グループ情報提供インターフェース ------------------------

source: Routes are handled by the class ``Kanboard\Core\Http\Route``.
ja: ``Kanboard\Core\Http\Route`` クラスによってルートはハンドルされています。

source: Custom Config File ------------------
ja: カスタム設定ファイル ------------------

source: From the board, click on the plus sign next to the column name:
ja: ボードから、カラム名の隣にある+(プラス)記号をクリックしてください:

source: - **array(“name” => “value”)** (array, required)
ja: - **array(“name” => “value”)** (配列, 必須)

source: - A smaller pull-request is easier to review and it will be merged faster.
ja: - 小さいプルリクエストは査読がより簡単になり、より早くマージされます。

source: // Mysql/Postgres password
ja: // Mysql/Postgres でのパスワード

source: User Provider Interface -----------------------
ja: ユーザー情報提供インターフェース -----------------------

source: Migrations must be stored in a folder **Schema** and the filename must be the same as the database driver:
ja: マイグレーションは **Schema** フォルダに保存されている、データベースのドライバーと同じファイル名のものでなければなりません :

source: Build Your Own Docker Image ---------------------------
ja: 自分でDockerイメージをビルドする ---------------------------

source: - This is not really practical to use the board on a tiny screen.
ja: - 小さい画面でボードを使うのは実用的ではありません。

source: The date must use the ISO 8601 format: **YYYY-MM-DD**.
ja: 日付は ISO 8601形式である必要があります: **YYYY-MM-DD**.

source: - Purpose: **Get category information**
ja: - 用途: **カテゴリの情報を取得する**

source: Average Time Spent Into Each Column -----------------------------------
ja: 各カラムでの平均経過時間 -----------------------------------

source: Attribute: **project**
ja: 属性: **project**

source: PHP Installation ~~~~~~~~~~~~~~~~
ja: PHP のインストール ~~~~~~~~~~~~~~~~

source: plugin:uninstall Remove a plugin
ja: plugin:uninstall プラグインを削除する

source: - Find tasks for several projects: ``project:"My project A" project:"My project B"``
ja: - 複数のプロジェクトからタスクを検索: ``project:"My project A" project:"My project B"``

source: You will be prompted for a password and confirmation.
ja: 画面の指示に従ってパスワードを入力・確認してください。

source: - **providerName** (string, required)
ja: - **providerName** (string,必須)

source: RememberMe Authentication settings ----------------------------------
ja: RememberMe 認証の設定 ----------------------------------

source: Creation:
ja: 作成:

source: All formats are available in the `PHP documentation <http://php.net/sprintf>`__.
ja: 利用可能な全てのフォーマットについては `PHP のドキュメンテーション <http://php.net/sprintf>`__ を参照してください。

source: Download the library from the `official Microsoft website <http://www.microsoft.com/en-us/download/details.aspx?id=30679>`__ 2.
ja: このライブラリを `Microsoft 公式webサイト <http://www.microsoft.com/en-us/download/details.aspx?id=30679>`__ からダウンロードする 2.

source: With Selenium and the Kanboard app running, from your Kanboard directory, run the command ``make test-browser``.
ja: SeleniumとKanboardを同時に実行するには、Kanboardのディレクトリで ``make test-browser`` を実行してください。

source: From your Kanboard directory, run the command ``phpunit -c tests/units.postgres.xml``.
ja: Kanboardのディレクトリから、``phpunit -c tests/units.postgresql.xml`` コマンドを実行してください。

source: // Available log drivers: syslog, stderr, stdout or file define('LOG_DRIVER', '');
ja: // 利用可能なログドライバ: syslog, stderr, stdout or file define('LOG_DRIVER', '');

source: The list contains all supported time zones by your web server.
ja: このリストは使用しているwebサーバーがサポートしているタイムゾーン全てを含みます。

source: Example with Java -----------------
ja: Javaを使用する例 -----------------

source: - Purpose: **Download file contents (encoded in base64)**
ja: - 用途: **(base64でエンコードされた)ファイルの内容を取得する**

source: Kanboard use the `Time-based One-time Password Algorithm <http://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm>`__ defined in the `RFC 6238 <http://tools.ietf.org/html/rfc6238>`__.
ja: Kanboard は `RFC 6238 <http://tools.ietf.org/html/rfc6238>`__ で規定される、`Time-based One-time Password Algorithm <http://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm>`__ を使用します。

source: - **category_id** (integer, optional)
ja: - **category_id** (integer, 任意)

source: Attribute: **updatedRange**, **modifiedRange**
ja: 属性: **updatedRange**, **modifiedRange**

source: List of merging hooks:
ja: マージしたフックのリスト:

source: - The category
ja: - カテゴリ

source: - **identifier** (alphanumeric string, optional)
ja: - **identifier** (alphanumeric string, 任意)

source: By default, Kanboard use those column names: Backlog, Ready, Work in progress and Done.
ja: デフォルトでは、Kanboardは以下のカラム名を使用します: Backlog, Ready, Work in progress, Done

source: - Example of possible clients: native mobile/desktop application, command line utility, etc…
ja: - クライアントの例: ネイティブなモバイル/デスクトップアプリケーション, コマンドラインユーティリティ, 等・・・

source: **You must change the path of the PHP executable and the path of the Kanboard’s script according to your installation.**
ja: **PHPの実行ファイルのパスとKanboardのスクリプトのパスは実際のインストールに合わせなければなりません。**

source: Uncomment these PHP modules:
ja: これらの PHP モジュールのコメント化を解除する:

source: New routes can be added by using the method ``addRoute($path, $controller, $action, $plugin)``, here an example:
ja: 新しいルートは ``addRoute($path, $controller, $action, $plugin)`` メソッドを使うことで追加できるので、ここに例示します:

source: - Do not use Sqlite with NFS.
ja: - NFS上のSqliteを使用しないでください。

source: The first argument is the name of the hook and the second is a PHP callable.
ja: 最初の引数はフックの名前で、2つめはPHPのcallableです。

source: - If the creator is project manager, he can choose to share the filter with other project members.
ja: - 作成者がプロジェクト管理者ならば、他のプロジェクトメンバーとフィルタを共有するか選択できます。

source: The auto-completion form will show up to suggest available tags.
ja: フォームのオートコンプリート機能が利用可能なタグをサジェスト表示します。

source: // LDAP attribute for user language, example: 'preferredlanguage'
ja: // LDAP 属性のユーザーの言語。例: 'preferredlanguage'

source: +---------------+---------------------------------------+ | PHP Extension | Note | +===============+=======================================+ | zip | Used to install plugins from web ui | +---------------+---------------------------------------+ | ldap | Only for LDAP integration | +---------------+---------------------------------------+
ja: +---------------+---------------------------------------+ | PHP 拡張| 注記 | +===============+=======================================+ | zip | web uiからプラグインをインストールするのに使用 | +---------------+---------------------------------------+ | ldap | LDAP 統合をのためだけに必要 | +---------------+---------------------------------------+

source: External plugins allow you to send notifications to Slack, Hipchat, Jabber or any chat system.
ja: 外部ブラグインによって、Slack, Hipchat, Japperその他のチャットシステムに通知を送ることもできます。

source: - **task_limit** (integer, optional)
ja: - **task_limit** (integer, 任意)

source: - Purpose: **Disable a user**
ja: - 用途: **ユーザーを無効化する**

source: - Purpose: **Create a new user**
ja: - 用途: **ユーザーの新規作成**

source: - Result on success: **Dictionary of color_id => color_name**
ja: - 成功時の返り値: **Dictionary of color_id => color_name**

source: Template names without prefix are core templates.
ja: テンプレート名はコアとなるテンプレートの接頭辞はありません.

source: - ``ReverseProxyUserProvider`` for a Reverse-Proxy user
ja: - ``ReverseProxyUserProvider`` はリバースプロキシのユーザーの情報を提供します。

source: The (fully-qualified) hostname supplied in the HELO command can be set explicitly by:
ja: HELOコマンドで(完全限定ドメイン名である)ホスト名を提供する事を明示するには:

source: Categories are not global to the application but attached to a project.
ja: カテゴリはアプリケーション全体には適用されず、プロジェクトに付属します。

source: - Purpose: **Get all files attached to task**
ja: - 用途: **タスクに添付された全てのファイルを取得する**

source: // Mysql SSL certificate
ja: // Mysql のSSL 証明書

source: - Result on success: **column_id**
ja: - 成功時の返り値: **column_id**

source: - Since the version 1.2, Kanboard requires at least PHP 5.6.
ja: - Kanboard 1.2 以降では、PHP 5.6 以降が必要になります。

source: # restart apache sudo rcapache2 restart
ja: # apache を再起動する sudo rcapache2 restart

source: - Kanban board is persistent
ja: - かんばんボードは恒久的

source: - Result on success: **swimlane properties**
ja: - 成功時の返り値: **スイムレーンのプロパティ**

source: - You may have to adjust the permissions of the folder data
ja: - フォルダのデータへのアクセス権を調整する必要があるかもしれません。

source: - Reverse-Proxy authentication
ja: - リバースプロキシ認証

source: Subtask API Procedures ======================
ja: サブタスクのAPIプロシージャ ======================

source: Task API Procedures ===================
ja: タスクのAPIプロシージャ ===========================

source: - The RememberMe cookie method implements ``PreAuthenticationProviderInterface``
ja: - RememberMe cookieのメソッドの実装は ``PreAuthenticationProviderInterface`` です。

source: There is a ``docker-compose.yml`` file in Kanboard repository.
ja: ``docker-compose.yml`` ファイルはKanboardのリポジトリ内にあります。

source: Everything moved since 2 days will have shadow around the task.
ja: 一昨日以降に動いた全てのタスクの周りに影が付きます。

source: define('MAIL_SMTP_HELO_NAME', null); // valid: null (default), or FQDN
ja: define('MAIL_SMTP_HELO_NAME', null); // null (デフォルト)か FQDN が使用できます

source: version Display Kanboard version
ja: version Kanboardのバージョンを表示

source: User Roles ----------
ja: ユーザーの役割 ----------

source: - Don’t forget to test your device before closing your session
ja: - セッションを閉じる前に、デバイスのテストを忘れないでください。

source: - **Removing a swimlane doesn’t remove tasks assigned to it**, those tasks will be moved to the default swimlane.
ja: - **スイムレーンの削除でそこに置かれたタスクの削除は出来ず** 、これらのタスクは規定のスイムレーンに移動されます。

source: Attribute: **modified** or **updated**
ja: 属性: **modified** もしくは **updated**

source: - Always use HTTPS with a valid certificate (avoid clear text communication)
ja: - 常に有効な証明書と共にHTTPS接続を行う (平分通信を避ける)

source: And here, an *italic* word with one *underscore*.
ja: また、一つの*アンダーバーかアスタリスク*で囲むと、*斜体*になります。

source: Developer's Guide =================
ja: 開発者向けガイド =================

source: Examples to define a new policy from your plugin:
ja: あなたのプラグインから新しいポリシーを定義する例:

source: For example, Apache add ``REMOTE_USER`` by default if ``Require valid-user`` is set.
ja: 例えば、デフォルトで ``Require valid-user`` をセットするようになっていた場合、 ``REMOTE_USER`` をApacheが追加するでしょう。

source: - Purpose: **Enable a project**
ja: - 用途: **プロジェクトを有効化する**

source: This example will fetch the user #123:
ja: ユーザー #123 を取得する例:

source: Operators supported with a date:
ja: 演算子は日付をサポートしています:

source: Upgrading to a New Version ==========================
ja: 新しいバージョンへのアップグレード ==========================

source: - Purpose: **Remove a category**
ja: - 用途: **カテゴリの削除**

source: You need to define that manually because Kanboard cannot guess the URL from a command line script and some people have a very specific configuration.
ja: KanboardはコマンドラインスクリプトからURLを推測できず、特殊なネットワーク設定な人もいるので、これは手動で設定する必要があります。

source: Improve Email notifications speed ---------------------------------
ja: Email通知の速度を向上させる ---------------------------------

source: - **Check that your backup is valid!**
ja: - **バックアップが有効か確認する**

source: - Make sure the directory ``data`` is writable by the IIS user
ja: - IISのユーザーが ``data`` ディレクトリに書き込み出来るか確認してください。

source: // We choose "sendmail" as mail transport define('MAIL_TRANSPORT', 'sendmail');
ja: // "sendmail" をメール送信方法として選択する define('MAIL_TRANSPORT', 'sendmail');

source: Each project has a different set of automatic actions.
ja: 各々のプロジェクトには、異なる自動アクションを持たせられます。

source: - **creator_id** (integer, optional)
ja: - **creator_id** (integer, 任意)

source: `RabbitMQ <https://www.rabbitmq.com/>`__ is a robust messaging system that is more suitable for high-availability infrastructure.
ja: `RabbitMQ <https://www.rabbitmq.com/>`__ は、高可用性インフラに適した堅牢なメッセージングシステムです。

source: - Result on success: **category_id**
ja: - 成功時の返り値: **カテゴリのID**

source: Here is an example:
ja: ここに例を示しますe:

source: IIS Modules ~~~~~~~~~~~
ja: IIS モジュール ~~~~~~~~~~~

source: Group Backend Provider Interface --------------------------------
ja: グループのバックエンドプロバイダのインターフェース --------------------------------

source: Or if you have defined a project identifier:
ja: もしくは、プロジェクト識別子を定義済みならば:

source: - Result on success: **task_id**
ja: - 成功時の返り値: **task_id**

source: (all members except viewers)
ja: (閲覧者を除く全てのメンバー)

source: This is different to TLS, which starts off in cleartext (port 389 by default) and then sets up encryption over the same channel.
ja: これはTLSとは異なり、平分で開始されますが(ポート:デフォルトで389)、その後同チャンネル上で暗号化をセットアップします。

source: This feature is enabled only if LDAP authentication is activated and the parameter ``LDAP_USER_ATTRIBUTE_PHOTO`` is defined.
ja: この機能はLDAP認証が有効で、 ``LDAP_USER_ATTRIBUTE_PHOTO`` のパラメータが定義されている場合のみ有効になります。

source: // Database driver: sqlite, mysql or postgres (sqlite by default)
ja: // データベースのドライバ: sqlite, mysql, postgres (デフォルトは sqlite )

source: In case your hosting provider doesn't offer CLI access, you can run cron jobs by calling a URL.
ja: 利用中のホスティングサービスがCLIアクセスを提供していない場合、URLの呼び出しによってcronjobを実行できます。

source: - Purpose: **Get the timezone of the connected user**
ja: - 用途: **接続しているユーザーのタイムゾーンを取得する**

source: - Purpose: **Create a new comment**
ja: - 用途: **新しいコメントを作成する**

source: There are multiple ways to define a cronjob on Unix/Linux operating systems, this example is for Ubuntu 14.04.
ja: Unix/Linux上では、これらのcronjobを設定するには複数の方法があります。これはUbuntu 14.04での例です。

source: Kanboard records the time between each subtask status change in a separate table.
ja: Kanboardはサブタスクの状態の変更の都度、別のテーブルに時間を記録します。

source: If you need to get the attention of someone in a comment or in a task, use the @ symbol followed by their username.
ja: 誰かに注意を払わせる必要がある場合は、タスク説明内かコメントで、 ユーザー名の前に@を付けて言及してください。(訳注:例えば、 「@admin」 とするとadminに言及でき、通知を有効にしていればadminに通知が送られる)

source: figure:: /_static/new-user.png :alt: New user
ja: figure:: /_static/new-user.png :alt: 新規ユーザー

source: Template Hooks --------------
ja: フックのテンプレート --------------

source: The hook callback must return an array.
ja: フックのコールバックは配列を返す必要があります。

source: OpenLDAP with groupOfNames --------------------------
ja: GroupOfNames を使用するOpenLDAP --------------------------

source: You must have a web server with PHP installed 2.
ja: PHPがインストールされたWebサーバーが必要です。 2.

source: // LDAP server hostname define('LDAP_SERVER', 'myserver.example.com');
ja: // LDAP サーバーのホスト名 define('LDAP_SERVER', 'myserver.example.com');

source: // Enable or disable "X-Frame-Options: DENY" HTTP header
ja: // "X-Frame-Options: DENY" HTTP ヘッダの有効化/無効化

source: - Each time you stop the clock the end date is recorded in the time tracking table
ja: - タイマーを停止する都度、時間追跡テーブルに終了日時を記録します

source: - **recurrence_factor** (integer, optional)
ja: - **recurrence_factor** (integer, 任意)

source: Optional parameters:
ja: 追加のパラメータ:

source: figure:: /_static/link-labels.png :alt: Link Labels
ja: figure:: /_static/link-labels.png :alt: リンクラベル

source: - Expand/collapse tasks = **s**
ja: - タスクの展開/折り畳み = **s**

source: The colon prefix ``:``, define a variable.
ja: 接頭辞のコロン ``:`` が、変数の定義です。

source: You can also select only some projects, by default it’s all projects where you are a member.
ja: また、通知を送るプロジェクトを選択することもできます。デフォルトでは参加しているプロジェクト全ての通知を送ります。

source: - Result on success: **base64 encoded string**
ja: - 成功時の返り値: **base64でエンコードされた文字列**

source: Mail Transport ==============
ja: Mail 送信 ==============

source: * Send notification to a user
ja: * ユーザーに通知を送る

source: - Result on success: **List of events**
ja: - 成功時の返り値: **イベントのリスト**

source: After each commit pushed on the main repository, unit tests are executed across various versions of PHP:
ja: メインのリポジトリにコミットがプッシュされた後に、その都度様々なバージョンのPHPで単体テストが実行されます。

source: - This is up to the Kanboard instance owner to check if a plugin is legit.
ja: - プラグインが正当性を確認するのはKanboardのインスタンスの所有者です。

source: To connect to your LDAP server easily, use this method:
ja: LDAP サーバーへの接続は簡単で、以下のメソッドを使用します:

source: plugin:upgrade Update all installed plugins
ja: plugin:upgrade インストール済みのプラグインを全て更新する

source: Optionally, the plugin can offer a custom form to save extra information to the external system.
ja: 任意で、プラグインは外部システムに追加の情報を保存するカスタムフォームを提示できます。

source: - Download the zip file
ja: - Zipファイルをダウンロードする

source: - Kanboard returns a “Page not found” error
ja: - そしてKanboardは “Page not found” エラーを返す

source: Example for Microsoft Active Directory --------------------------------------
ja: Microsoft Active Directory の例 --------------------------------------

source: - Project Manager
ja: - プロジェクト管理者

source: Each column name must be separated by a comma.
ja: 各々のカラムはカンマで区切らなければなりません。

source: The end-user select an alternative task provider during the task creation 2.
ja: エンドユーザーが別のタスクのプロバイダからタスクを作成することを選択する 2.

source: removeColumn ------------
ja: カラムの削除 ------------

source: - `Automatic Action example <https://github.com/kanboard/plugin-example-automatic-action>`__
ja: - `自動アクションの例 <https://github.com/kanboard/plugin-example-automatic-action>`__

source: The first argument is the name of the hook and the second argument is the template name.
ja: 最初の引数はフックの名前で、2つ目の引数はテンプレート名です。

source: // Session handler: db or php
ja: // セッションハンドラ: db or php

source: - **Start Date**: This is a date time field.
ja: - **開始日**: これは日時のフィールドです。

source: - **Priority**: Task priority, the range can be defined in the project settings, default values are P0 to P3.
ja: - **優先度**: タスクの優先度で、範囲はプロジェクト設定で定義します。デフォルトではP0からP3です。

source: Attribute: **title** or none (default)
ja: 属性: **title** or none (default)

source: Assign the role to someone '''''''''''''''''''''''''''''
ja: 誰かに役割を割り当てる '''''''''''''''''''''''''''''

source: - `Authentication providers included in Kanboard <https://github.com/kanboard/kanboard/tree/master/app/Auth>`__
ja: - `Kanboard に含まれる認証プロバイダ <https://github.com/kanboard/kanboard/tree/master/app/Auth>`__

source: // Example for OpenLDAP: 'cn'
ja: // OpenLDAPでの例: 'cn'

source: - Purpose: **Get all registered external link providers**
ja: - 用途: **登録済みの全ての外部リンクの提供元を取得する**

source: Example:
ja: 例:

source: // Example for OpenLDAP: ou=People,dc=example,dc=com
ja: // OpenLDAPでの例: ou=People,dc=example,dc=com

source: - Confirmed
ja: - 確認中

source: - Result on success: **List of links**
ja: - 成功時の返り値: **リンクのリスト**

source: - **Complexity**: Used in agile project management (Scrum), the complexity or story points is a number that tells the team how hard the story is.
ja: - **複雑さ**: アジャイルプロジェクト管理(スクラム)で使用される、複雑さ・ストーリーポイントは難易度をチームに知らせるための数字です。

source: This feature works only for authentication methods that use the login form.
ja: この機能は認証方法にログインフォームを使用している場合のみに作動します。

source: There is also a filter by recently modified tasks: ``modified:recently``.
ja: また、最近変更されたタスクのフィルタは :``modified:recently``. です。

source: Check for duplicates before creating a new issue.
ja: 新しいissueを作る前に、重複が無いか確認してください。

source: // Example for OpenLDAP: (&(objectClass=posixGroup)(memberUid=%s))
ja: // OpenLDAP の例: (&(objectClass=posixGroup)(memberUid=%s))

source: // Comma separated list of fields to not synchronize when using external authentication providers define('EXTERNAL_AUTH_EXCLUDE_FIELDS', 'username');
ja: // 外部認証を使用している時に同期させないコンマ区切りのリストのフィールド define('EXTERNAL_AUTH_EXCLUDE_FIELDS', 'username');

source: - Attachment: Link to anything that is not a web page
ja: - 添付: webページ以外の全てのものとリンク

source: // Mysql SSL CA
ja: // Mysql のSSL認証局

source: Don’t forget the ending slash ``/``.
ja: URLの最後のスラッシュ( ``/`` )を忘れないでください。

source: Each subtask:
ja: 各々のサブタスクは:

source: Kanboard is able to work indifferently with URL rewriting enabled or not.
ja: KanboardはURL rewritingが有効/無効にかかわらず動作可能です。

source: Group API Procedures ====================
ja: グループのAPIプロシージャ ====================

source: This command calculate the statistics of each project:
ja: このコマンドはプロジェクト毎に統計を計算します:

source: If another subtask have the status “in progress”, the user will see this dialog box:
ja: もし別のサブタスクを "進行中"にしようとすると、下記のダイヤログボックスが表示されるでしょう:

source: If the end-user wants to use OAuth2, the selected provider will be executed 5.
ja: エンドユーザーがOAuth2の使用を望むならば、選択したプロバイダが実行されます。 5.

source: Custom project roles can be created to apply a set of restrictions to the users.
ja: ユーザーに制限を掛けるために、プロジェクト独自の役割を作成することができます。

source: figure:: /_static/swimlane-configuration.png :alt: Swimlanes Configuration
ja: figure:: /_static/swimlane-configuration.png :alt: スイムレーンの設定

source: Manual instructions -------------------
ja: 手動構築手順の説明 -------------------
